# Retail Sales Case Study

## Introduction
This project involves a comprehensive analysis of a dataset provided by a prominent retail giant. The dataset encompasses crucial information on customer demographics, purchase behavior, and response to marketing campaigns. The primary objective is to glean actionable insights into customer behavior and campaign effectiveness to drive strategic business decisions.

## Dataset Overview
The dataset comprises three essential files:

1. **demographics.txt**: Contains granular details on customer demographics.
2. **behaviour.json**: Provides insightful data regarding customer purchase behavior.
3. **campaign.json**: Offers valuable insights into customer response patterns to marketing campaigns.

### Data Dictionary
#### demographics.txt
- **ID**: Customer's unique identifier
- **Year_Birth**: Customer's birth year
- **Education**: Customer's educational attainment
- **Marital_Status**: Customer's marital status
- **Income**: Customer's annual household income
- **Kidhome**: Number of children in the customer's household
- **Teenhome**: Number of teenagers in the customer's household
- **Dt_Customer**: Date of customer enrollment with the company
- **Country**: Customer's geographical location

#### behaviour.json
- **Recency**: Number of days since the customer's last purchase
- **MntWines**: Expenditure on wine over the past 2 years
- **MntFruits**: Expenditure on fruits over the past 2 years
- **MntMeatProducts**: Expenditure on meat products over the past 2 years
- **MntFishProducts**: Expenditure on fish products over the past 2 years
- **MntSweetProducts**: Expenditure on sweet products over the past 2 years
- **MntGoldProducts**: Expenditure on gold products over the past 2 years
- **NumDealsPurchases**: Number of purchases made with a discount
- **NumWebPurchases**: Number of purchases made through the company's website
- **NumCatalogPurchases**: Number of purchases made using a catalog
- **NumStorePurchases**: Number of purchases made directly in stores
- **NumWebVisitsMonth**: Number of visits to the company's website in the last month

#### campaign.json
- **AcceptedCmp1**: Customer's response to the 1st campaign (1 for acceptance, 0 otherwise)
- **AcceptedCmp2**: Customer's response to the 2nd campaign (1 for acceptance, 0 otherwise)
- **AcceptedCmp3**: Customer's response to the 3rd campaign (1 for acceptance, 0 otherwise)
- **AcceptedCmp4**: Customer's response to the 4th campaign (1 for acceptance, 0 otherwise)
- **AcceptedCmp5**: Customer's response to the 5th campaign (1 for acceptance, 0 otherwise)
- **Response**: Customer's response to the latest campaign (1 for acceptance, 0 otherwise)
- **Complain**: Customer's complaint status (1 if complained in the last 2 years, 0 otherwise)

## Business Problem
The retailer aims to gain a comprehensive understanding of customer responses to various marketing campaigns. Through meticulous analysis of the dataset, we aim to address specific business queries and unearth actionable insights that drive informed decision-making.

### Business Questions
1. **Data Quality and Check (Task 1)**:
    - Create a consolidated view of the data by integrating information from all files.
    - Identify variables necessitating data cleaning and execute requisite data cleansing procedures.
    - Generate a meticulous data quality report, highlighting key insights.
    - Identify and address any outliers or extreme values within the dataset.
2. **Business Analysis and Hypothesis (Task 2)**:
    - Formulate and validate hypotheses regarding customer spending across different product categories and response rates to marketing campaigns.
    - Conduct a comprehensive funnel analysis to ascertain campaign acceptance rates.
    - Investigate the influence of income levels on expenditure across various product categories.
    - Test the hypothesis suggesting that recent customers exhibit lower complaint rates compared to established customers.
    - Explore the correlation between customer responses across multiple campaigns.
    - Profile customers who exhibit positive response behaviors in marketing campaigns.

The subsequent sections will delve into the analysis process, aiming to provide actionable insights that cater to the retailer's strategic objectives.

## Data Exploration and Preprocessing

### Importing Necessary Libraries

In [1]:
# Importing essential libraries for data analysis
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import json

### Loading Demographics Dataset

In [2]:
# Open the text file
file_path = 'demographics.txt'

# Read the file into a DataFrame using pandas
demog = pd.read_csv(file_path, sep='\t')

# Display first five rows
demog.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,SP
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,CA
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,US
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,AUS
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,SP

#### Looking into demographic's info

In [3]:
demog.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              2240 non-null   int64
 1   Year_Birth      2240 non-null   int64
 2   Education       2240 non-null   object
 3   Marital_Status  2240 non-null   object
 4    Income         2216 non-null   object
 5   Kidhome         2240 non-null   int64
 6   Teenhome        2240 non-null   int64
 7   Dt_Customer     2240 non-null   object
 8   Country         2240 non-null   object
dtypes: int64(4), object(5)
memory usage: 157.6+ KB

### Loading Behaviour Dataset

In [4]:
# Load the JSON data from the file
with open('behaviour.json') as f:
    data = json.load(f)

# Initialize a dictionary to store transformed data
transformed_data = {}

# Iterate over each item in the JSON data
for item in data:
    for key, value in item.items():
        # Extract attribute names and initialize dictionary keys if not already done
        if not transformed_data:
            transformed_data = {attr: [] for attr in value.keys()}
        
        # Append values to the corresponding lists in the dictionary
        for attribute, val in value.items():
            transformed_data[attribute].append(val)
            
        # Append ID values to the 'ID' list
        if 'ID' not in transformed_data:
            transformed_data['ID'] = []
        transformed_data['ID'].append(key)

# Create a DataFrame from the transformed data
behav = pd.DataFrame(transformed_data)

# Reorder columns such that 'ID' appears first
column_order = ['ID'] + [col for col in behav.columns if col != 'ID']
behav = behav[column_order]

# Display the DataFrame
behav.head(10)

,ID,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,ID_1826,0,189,104,379,111,189,218,1,4,4,6,1
1,ID_1,0,464,5,64,7,0,37,1,7,3,7,5
2,ID_10476,0,134,11,59,15,2,30,1,3,2,5,2
3,ID_1386,0,10,0,1,0,0,0,1,1,0,2,7
4,ID_5371,0,6,16,24,11,0,34,2,3,1,2,7
5,ID_7348,0,336,130,411,240,32,43,1,4,7,5,2
6,ID_4073,0,769,80,252,15,34,65,1,10,10,7,6
7,ID_1991,0,78,0,11,0,0,7,1,2,1,3,5
8,ID_4047,0,384,0,102,21,32,5,3,6,2,9,4
9,ID_9477,0,384,0,102,21,32,5,3,6,2,9,4

#### Transforming behaviour's table ID column into usable form

In [5]:
# Removing strings from ID column to match with other tables
behav['ID'] = behav['ID'].str.extract('(\d+)').astype(int)
behav.head()

,ID,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,1826,0,189,104,379,111,189,218,1,4,4,6,1
1,1,0,464,5,64,7,0,37,1,7,3,7,5
2,10476,0,134,11,59,15,2,30,1,3,2,5,2
3,1386,0,10,0,1,0,0,0,1,1,0,2,7
4,5371,0,6,16,24,11,0,34,2,3,1,2,7

#### Looking into Behaviour's info

In [6]:
behav.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int32
 1   Recency              2240 non-null   int64
 2   MntWines             2240 non-null   int64
 3   MntFruits            2240 non-null   int64
 4   MntMeatProducts      2240 non-null   int64
 5   MntFishProducts      2240 non-null   int64
 6   MntSweetProducts     2240 non-null   int64
 7   MntGoldProds         2240 non-null   int64
 8   NumDealsPurchases    2240 non-null   int64
 9   NumWebPurchases      2240 non-null   int64
 10  NumCatalogPurchases  2240 non-null   int64
 11  NumStorePurchases    2240 non-null   int64
 12  NumWebVisitsMonth    2240 non-null   int64
dtypes: int32(1), int64(12)
memory usage: 218.9 KB

### Loading Campaign Dataset

In [7]:
# Load the JSON data from the file
with open('campaign.json') as f:
    data = json.load(f)

# Initialize a dictionary to store transformed data
transformed_data2 = {}

# Iterate over each item in the JSON data
for item in data:
    for key, value in item.items():
        # Extract attribute names and initialize dictionary keys if not already done
        if not transformed_data2:
            transformed_data2 = {attr: [] for attr in value.keys()}
        
        # Append values to the corresponding lists in the dictionary
        for attribute, val in value.items():
            transformed_data2[attribute].append(val)
            
        # Append ID values to the 'ID' list
        if 'ID' not in transformed_data2:
            transformed_data2['ID'] = []
        transformed_data2['ID'].append(key)

# Create a DataFrame from the transformed data
campa = pd.DataFrame(transformed_data2)

# Reorder columns such that 'ID' appears first
column_order = ['ID'] + [col for col in campa.columns if col != 'ID']
campa = campa[column_order]

# Display the DataFrame
campa.head(10)

,ID,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,ID_1826,0,0,0,0,0,1,0
1,ID_1,0,1,0,0,0,1,0
2,ID_10476,0,0,0,0,0,0,0
3,ID_1386,0,0,0,0,0,0,0
4,ID_5371,0,0,1,0,0,1,0
5,ID_7348,0,0,0,0,0,1,0
6,ID_4073,0,0,1,0,0,1,0
7,ID_1991,0,0,0,0,0,0,0
8,ID_4047,0,0,0,0,0,0,0
9,ID_9477,0,0,0,0,0,0,0

#### Transforming Campaign's table ID column into usable form

In [8]:
campa['ID'] = campa['ID'].str.extract('(\d+)').astype(int)
campa.head()

,ID,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,0,0,0,0,0,1,0
1,1,0,1,0,0,0,1,0
2,10476,0,0,0,0,0,0,0
3,1386,0,0,0,0,0,0,0
4,5371,0,0,1,0,0,1,0

#### Looking into Campaign's info

In [9]:
campa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            2240 non-null   int32
 1   AcceptedCmp1  2240 non-null   int64
 2   AcceptedCmp2  2240 non-null   int64
 3   AcceptedCmp3  2240 non-null   int64
 4   AcceptedCmp4  2240 non-null   int64
 5   AcceptedCmp5  2240 non-null   int64
 6   Response      2240 non-null   int64
 7   Complain      2240 non-null   int64
dtypes: int32(1), int64(7)
memory usage: 131.4 KB

# Task 1

### Que 1. Merging all three tables and named it Merged_df for consolidated view of data

In [10]:
#merged using outer join to show all columns in all three tables
merged_df = pd.merge(demog, behav, on='ID', how='outer').merge(campa, on='ID', how='outer')
merged_df.head(10)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country,Recency,...,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp1,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,Response,Complain
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,SP,0,...,4,6,1,0,0,0,0,0,1,0
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,CA,0,...,3,7,5,0,1,0,0,0,1,0
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,US,0,...,2,5,2,0,0,0,0,0,0,0
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,AUS,0,...,0,2,7,0,0,0,0,0,0,0
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,SP,0,...,1,2,7,0,0,1,0,0,1,0
5,7348,1958,PhD,Single,"$71,691.00",0,0,3/17/14,SP,0,...,7,5,2,0,0,0,0,0,1,0
6,4073,1954,2n Cycle,Married,"$63,564.00",0,0,1/29/14,GER,0,...,10,7,6,0,0,1,0,0,1,0
7,1991,1967,Graduation,Together,"$44,931.00",0,1,1/18/14,SP,0,...,1,3,5,0,0,0,0,0,0,0
8,4047,1954,PhD,Married,"$65,324.00",0,1,1/11/14,US,0,...,2,9,4,0,0,0,0,0,0,0
9,9477,1954,PhD,Married,"$65,324.00",0,1,1/11/14,IND,0,...,2,9,4,0,0,0,0,0,0,0

### Que 2. Variables where we need to clean the raw data and kind of cleaning which will be needed?

#### Looking into Merged Table's info

In [11]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 0 to 2239
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4    Income              2216 non-null   object
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Country              2240 non-null   object
 9   Recency              2240 non-null   int64
 10  MntWines             2240 non-null   int64
 11  MntFruits            2240 non-null   int64
 12  MntMeatProducts      2240 non-null   int64
 13  MntFishProducts      2240 non-null   int64
 14  MntSweetProducts     2240 non-null   int64
 15  MntGoldProds         2240 non-null   int64
 16  NumDealsPurchases    2240 non-null   int64
 17  NumWebPurchases      2240 non-null   int64
 18  NumCatalogPurchases  2240 non-null   int64
 19  NumStorePurchases    2240 non-null   int64
 20  NumWebVisitsMonth    2240 non-null   int64
 21  AcceptedCmp1         2240 non-null   int64
 22  AcceptedCmp2         2240 non-null   int64
 23  AcceptedCmp3         2240 non-null   int64
 24  AcceptedCmp4         2240 non-null   int64
 25  AcceptedCmp5         2240 non-null   int64
 26  Response             2240 non-null   int64
 27  Complain             2240 non-null   int64
dtypes: int64(23), object(5)
memory usage: 507.5+ KB

1. **Income**: 
- The Income column name has space in it so removing space in that and renaming it
- The $ sign should be removed also with commas and spaces in the values
- The data type should be changed to integer type for analysis purpose

2. **Dt_Customer**: The data type of this date column has to be converted into datetime type

### Que 3. Data Quality Report

#### Number of Null Values

In [12]:
# Calculating null values
null_count= merged_df.isna().sum()
null_count

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
 Income                24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Country                 0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp1            0
AcceptedCmp2            0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
Response                0
Complain                0
dtype: int64

#### Percentage of Null Values

In [13]:
null_percentage = (merged_df.isnull().mean() * 100).round(2)

In [14]:
# Percentage of null values
null_df = pd.DataFrame({'Column': null_percentage.index, 'Null Percentage': null_percentage.values})
null_df

                 Column  Null Percentage
0                    ID             0.00
1            Year_Birth             0.00
2             Education             0.00
3        Marital_Status             0.00
4               Income              1.07
5               Kidhome             0.00
6              Teenhome             0.00
7           Dt_Customer             0.00
8               Country             0.00
9               Recency             0.00
10             MntWines             0.00
11            MntFruits             0.00
12      MntMeatProducts             0.00
13      MntFishProducts             0.00
14     MntSweetProducts             0.00
15         MntGoldProds             0.00
16    NumDealsPurchases             0.00
17      NumWebPurchases             0.00
18  NumCatalogPurchases             0.00
19    NumStorePurchases             0.00
20    NumWebVisitsMonth             0.00
21         AcceptedCmp1             0.00
22         AcceptedCmp2             0.00
23         AcceptedCmp3             0.00
24         AcceptedCmp4             0.00
25         AcceptedCmp5             0.00
26             Response             0.00
27             Complain             0.00

#### Number of Zero Values

In [15]:
zero_count = (merged_df == 0).sum()
zero_count

ID                        1
Year_Birth                0
Education                 0
Marital_Status            0
 Income                   0
Kidhome                1293
Teenhome               1158
Dt_Customer               0
Country                   0
Recency                  28
MntWines                 13
MntFruits               400
MntMeatProducts           1
MntFishProducts         384
MntSweetProducts        419
MntGoldProds             61
NumDealsPurchases        46
NumWebPurchases          49
NumCatalogPurchases     586
NumStorePurchases        15
NumWebVisitsMonth        11
AcceptedCmp1           2096
AcceptedCmp2           2210
AcceptedCmp3           2077
AcceptedCmp4           2073
AcceptedCmp5           2077
Response               1906
Complain               2219
dtype: int64

#### Percentage of Zero Values

In [16]:
# Percentage of zero values
zero_percentage = ((merged_df == 0).mean() * 100).round(2)

In [17]:
zero_df = pd.DataFrame({'Column': zero_percentage.index, 'Zero Percentage': zero_percentage.values})
zero_df

                 Column  Zero Percentage
0                    ID             0.04
1            Year_Birth             0.00
2             Education             0.00
3        Marital_Status             0.00
4               Income              0.00
5               Kidhome            57.72
6              Teenhome            51.70
7           Dt_Customer             0.00
8               Country             0.00
9               Recency             1.25
10             MntWines             0.58
11            MntFruits            17.86
12      MntMeatProducts             0.04
13      MntFishProducts            17.14
14     MntSweetProducts            18.71
15         MntGoldProds             2.72
16    NumDealsPurchases             2.05
17      NumWebPurchases             2.19
18  NumCatalogPurchases            26.16
19    NumStorePurchases             0.67
20    NumWebVisitsMonth             0.49
21         AcceptedCmp1            93.57
22         AcceptedCmp2            98.66
23         AcceptedCmp3            92.72
24         AcceptedCmp4            92.54
25         AcceptedCmp5            92.72
26             Response            85.09
27             Complain            99.06

## Data Cleaning and Preprocessing

In [18]:
# Converting Dt_Customer column to date type
merged_df['Dt_Customer'] = pd.to_datetime(merged_df['Dt_Customer'])

In [19]:
# Renaming Income column to Income_$
merged_df = merged_df.rename(columns={' Income ': 'Income_$'})

In [25]:
# Cleaning Income column and imputing null values with zero assuming they don't have any income source
merged_df['Income_$'] =(merged_df['Income_$'].str.replace('[$,]', '', regex=True).str.strip().replace('', pd.NA).astype(float).fillna(0).astype(int))

#### Looking at Merged Data info after Data cleaning and preprocessing

In [26]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 0 to 2239
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income_$             2240 non-null   int32
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   datetime64[ns]
 8   Country              2240 non-null   object
 9   Recency              2240 non-null   int64
 10  MntWines             2240 non-null   int64
 11  MntFruits            2240 non-null   int64
 12  MntMeatProducts      2240 non-null   int64
 13  MntFishProducts      2240 non-null   int64
 14  MntSweetProducts     2240 non-null   int64
 15  MntGoldProds         2240 non-null   int64
 16  NumDealsPurchases    2240 non-null   int64
 17  NumWebPurchases      2240 non-null   int64
 18  NumCatalogPurchases  2240 non-null   int64
 19  NumStorePurchases    2240 non-null   int64
 20  NumWebVisitsMonth    2240 non-null   int64
 21  AcceptedCmp1         2240 non-null   int64
 22  AcceptedCmp2         2240 non-null   int64
 23  AcceptedCmp3         2240 non-null   int64
 24  AcceptedCmp4         2240 non-null   int64
 25  AcceptedCmp5         2240 non-null   int64
 26  Response             2240 non-null   int64
 27  Complain             2240 non-null   int64
dtypes: datetime64[ns](1), int32(1), int64(23), object(3)
memory usage: 498.8+ KB

In [ ]:
merged_df.head()

In [ ]:
import numpy as np

# Assuming merged_df is your DataFrame containing the 'Income_$' column

# Interquartile Range (IQR) Method
Q1 = merged_df['Income_$'].quantile(0.25)
Q3 = merged_df['Income_$'].quantile(0.75)
IQR = Q3 - Q1

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

outliers_iqr = merged_df[(merged_df['Income_$'] < lower_bound) | (merged_df['Income_$'] > upper_bound)]
print("Outliers using IQR method:")
outliers_iqr["Income_$"]

In [ ]:
# Z-score Method
mean_income = merged_df['Income_$'].mean()
std_dev_income = merged_df['Income_$'].std()

threshold = 3  # Adjust this threshold as needed (common values are 2 or 3)
outliers_zscore = merged_df[np.abs((merged_df['Income_$'] - mean_income) / std_dev_income) > threshold]
print("\nOutliers using Z-score method:")
outliers_zscore['Income_$']

In [ ]:
# Calculate mean or median of non-outlier values
non_outlier_values = merged_df[~merged_df.index.isin(outliers_iqr.index)]['Income_$']
imputation_value = non_outlier_values.mean()

# Impute zero values
merged_df.loc[merged_df['Income_$'] == 0, 'Income_$'] = imputation_value

In [ ]:
# Identify numeric columns
numeric_columns = merged_df.select_dtypes(include=np.number).columns

# Identify categorical columns (assuming they are of object type)
categorical_columns = merged_df.select_dtypes(include='object').columns

# Exclude 'year', 'id', and categorical columns
columns_of_interest = [col for col in numeric_columns if col not in ['Year_Birth', 'ID']] 

# Calculate univariate statistics for selected columns
univariate_stats = merged_df[columns_of_interest].describe(percentiles=[0.25, 0.5, 0.75, 0.90, 0.95])

# Add min and max to the DataFrame
univariate_stats.loc['min'] = merged_df[columns_of_interest].min()
univariate_stats.loc['max'] = merged_df[columns_of_interest].max()

# Display the univariate statistics
univariate_stats

In [31]:
# Finding unique values in each categorical column
for col in merged_df.select_dtypes(include=object).columns:
    unique_values = merged_df[col].unique()
    print(f"Column {col}: Unique values: {unique_values}")

Column Education: Unique values: ['Graduation' 'PhD' '2n Cycle' 'Master' 'Basic']
Column Marital_Status: Unique values: ['Divorced' 'Single' 'Married' 'Together' 'Widow' 'YOLO' 'Alone' 'Absurd']
Column Country: Unique values: ['SP' 'CA' 'US' 'AUS' 'GER' 'IND' 'SA' 'ME']

In [32]:
# Calculate percentage of missing values and number of unique values for each categorical column
categorical_stats = pd.DataFrame(columns=['Missing%', 'Unique'])

for column in merged_df.select_dtypes(include='object').columns:
    missing_percentage = (merged_df[column].isna().sum() / len(merged_df)) * 100
    unique_values = merged_df[column].nunique()
    categorical_stats.loc[column] = [missing_percentage, unique_values]

# Display the categorical statistics
categorical_stats

                Missing%  Unique
Education            0.0     5.0
Marital_Status       0.0     8.0
Country              0.0     8.0

In [33]:
merged_df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income_$',
       'Kidhome', 'Teenhome', 'Dt_Customer', 'Country', 'Recency', 'MntWines',
       'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp1', 'AcceptedCmp2', 'AcceptedCmp3', 'AcceptedCmp4',
       'AcceptedCmp5', 'Response', 'Complain'],
      dtype='object')

In [34]:
import pandas as pd

# Define a function to detect outliers using the IQR method
def detect_outliers_iqr(data):
    Q1 = data.quantile(0.25)
    Q3 = data.quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    outliers = data[(data < lower_bound) | (data > upper_bound)]
    return outliers

# List of columns to check for outliers
columns_to_check = ['Income_$', 'Recency', 'MntWines', 'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts', 'MntGoldProds']

# Initialize an empty list to store outlier DataFrames
outliers_dfs = []

# Identify outliers for each column and store in a list
for column in columns_to_check:
    outliers = detect_outliers_iqr(merged_df[column])
    outliers_df = pd.DataFrame({'Column': column, 'Outliers': outliers})
    outliers_dfs.append(outliers_df)

# Concatenate all outlier DataFrames into a single DataFrame
outliers_df = pd.concat(outliers_dfs, ignore_index=True)

# Display the DataFrame containing outliers
outliers_df

            Column  Outliers
0         Income_$    157146
1         Income_$    160803
2         Income_$    666666
3         Income_$    162397
4         Income_$    157733
...            ...       ...
1118  MntGoldProds       191
1119  MntGoldProds       139
1120  MntGoldProds       187
1121  MntGoldProds       183
1122  MntGoldProds       144

[1123 rows x 2 columns]

In [35]:
import pandas as pd

# Define a function to detect outliers using the IQR method
def detect_outliers_iqr(data):
    Q1 = data.quantile(0.25)
    Q3 = data.quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    outliers_count = ((data < lower_bound) | (data > upper_bound)).sum()
    return outliers_count

# List of columns to check for outliers
columns_to_check = ['Income_$', 'Recency', 'MntWines', 'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts', 'MntGoldProds']

# Initialize an empty list to store outlier DataFrames
outliers_dfs = []

# Calculate outliers count for each column and store in a list
for column in columns_to_check:
    outliers_count = detect_outliers_iqr(merged_df[column])
    outliers_df = pd.DataFrame({'Column': [column], 'Outliers Count': [outliers_count]})
    outliers_dfs.append(outliers_df)

# Concatenate all outlier DataFrames into a single DataFrame
outliers_count_df = pd.concat(outliers_dfs, ignore_index=True)

# Display the DataFrame containing outliers count
outliers_count_df

             Column  Outliers Count
0          Income_$               8
1           Recency               0
2          MntWines              35
3         MntFruits             227
4   MntMeatProducts             175
5   MntFishProducts             223
6  MntSweetProducts             248
7      MntGoldProds             207